#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=lambdas/demo/helloWorldHandler.zip]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo/rds_migrations]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/demo/minimal_lambda_function]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/getCompanyHandler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/getAllCompaniesHandler.zip]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=9mwrfv]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=demo_minimal_lambda_function]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-kb7gblbu69-9mwrfv-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-kb7gblbu69-9mwrfv-GET]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=xrqyig]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be created
  + resource "aws_s3_bucket_object" "db_sample_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "26b80102efbf4ba23d7e30581bdccf42"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/dbSampleHandler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/dbSampleHandler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be created
  + resource "aws_s3_bucket_object" "etl_script_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "1ed9deda99b0d364b1fef4154ec995e3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "pyspark/kpinetwork_analizer.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../etl/kpinetwork_analizer.py"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "8629fdb25897db86a92b6cca12884d0d" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/getAllCompaniesHandler.zip" -> null
      - key                = "lambdas/demo/getAllCompaniesHandler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/getAllCompaniesHandler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be destroyed
  - resource "aws_s3_bucket_object" "get_company_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "a4cd1d4f6dfcb027f4db007e0ec7f44a" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/getCompanyHandler.zip" -> null
      - key                = "lambdas/demo/getCompanyHandler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/getCompanyHandler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be created
  + resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "5e3ff9a25f48a081b3ba3e304c2e9047"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/glueTriggerHandler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/glueTriggerHandler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be created
  + resource "aws_s3_bucket_object" "layer_libraries_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "52890ff491043ecb9d4997e0d0757390"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "layer/demo/layerLibraries.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/layerLibraries.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "0bd9fcc53ce5587c3bbde7e7da644f05" -> "83e1a5320aa7ecd2b57fdb3424c2b11a"
        id                 = "lambdas/demo/helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be created
  + resource "aws_lambda_function" "db_sample_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_db_sample_lambda_function"
      + handler                        = "dbSampleHandler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::435552912911:role/lambda_exec"
      + runtime                        = "python3.7"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/dbSampleHandler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "7xQ7hq6m1mz5mMPvyuUvM7qqDVxfcCE4E7kUR0sHE6c="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0b0383c09324099c1",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_all_companies_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_all_companies_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_all_companies_lambda_function" -> null
      - handler                        = "getAllCompaniesHandler.handler" -> null
      - id                             = "demo_get_all_companies_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_all_companies_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-10-29T20:21:44.097+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_all_companies_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/lambda_exec" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/getAllCompaniesHandler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "r79poNXzM/x212ZkAGhUVFVfdtbR7UbD9Tl7+PQL2Zc=" -> null
      - source_code_size               = 5331161 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be destroyed
  - resource "aws_lambda_function" "get_company_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_company_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_company_lambda_function" -> null
      - handler                        = "getCompanyHandler.handler" -> null
      - id                             = "demo_get_company_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_company_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-10-29T20:21:44.020+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_company_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/lambda_exec" -> null
      - runtime                        = "python3.6" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/getCompanyHandler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "F5HJBY9+L4VBXy106RROm9+kX23fy1zkq1r0KzGmpVM=" -> null
      - source_code_size               = 5331139 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0b0383c09324099c1",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be created
  + resource "aws_lambda_function" "glue_trigger_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_glue_trigger_lambda_function"
      + handler                        = "glueTriggerHandler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.7"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/glueTriggerHandler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "WlRda64MC9LCQsUhQ+FVzCN6540ORBzHeHHOJCslCSo="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_FILES" = "kpinetwork-files"
              + "ENV"          = "demo"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "demo_minimal_lambda_function"
      ~ last_modified                  = "2021-10-29T20:21:43.750+0000" -> (known after apply)
      ~ runtime                        = "python3.6" -> "python3.7"
      ~ source_code_hash               = "g+DaLX/o5b/fRMDZmu+w65gomUB/ZO+oqxC72KuBF+I=" -> "cpZRoTMU6jGvGyNSp4zl2sJ/xCcAjE58Rrb4kWArh0E="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_layer_version.db_lambda_layer will be created
  + resource "aws_lambda_layer_version" "db_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
        ]
      + created_date                = (known after apply)
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "demo_db_lambda_layer"
      + s3_bucket                   = "kpinetwork-backend"
      + s3_key                      = "layer/demo/layerLibraries.zip"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.functions.aws_lambda_permission.glue_trigger_event_permission will be created
  + resource "aws_lambda_permission" "glue_trigger_event_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_glue_trigger_lambda_function"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = "arn:aws:s3:::kpinetwork-files"
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

  # module.functions.aws_s3_bucket_notification.files_bucket_notification will be created
  + resource "aws_s3_bucket_notification" "files_bucket_notification" {
      + bucket = "kpinetwork-files"
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:Put",
            ]
          + filter_prefix       = "demo/"
          + id                  = "aws_s3_bucket_notification_demo_glue_trigger_lambda_function"
          + lambda_function_arn = (known after apply)
        }
    }

  # module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "glue_trigger_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_glue_trigger_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.minimal_lambda_function must be replaced
-/+ resource "aws_cloudwatch_log_group" "minimal_lambda_function" {
      ~ arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo/minimal_lambda_function" -> (known after apply)
      ~ id                = "/aws/lambda/demo/minimal_lambda_function" -> (known after apply)
      ~ name              = "/aws/lambda/demo/minimal_lambda_function" -> "/aws/lambda/demo_minimal_lambda_function" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.network.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-10-29T20:21:43Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xrqyig" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2021-10-29T20:21:42Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_integration.companies_integration will be destroyed
  - resource "aws_api_gateway_integration" "companies_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "bnvar7" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-bnvar7-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "bnvar7" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_all_companies_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.company_integration will be destroyed
  - resource "aws_api_gateway_integration" "company_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "sjvaet" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-sjvaet-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "sjvaet" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_company_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_method.get_all_companies_method will be destroyed
  - resource "aws_api_gateway_method" "get_all_companies_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-bnvar7-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.limit"  = true
          - "method.request.querystring.offset" = true
        } -> null
      - resource_id          = "bnvar7" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_company_method will be destroyed
  - resource "aws_api_gateway_method" "get_company_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-sjvaet-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "sjvaet" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.companies will be destroyed
  - resource "aws_api_gateway_resource" "companies" {
      - id          = "bnvar7" -> null
      - parent_id   = "0ay34r2gi9" -> null
      - path        = "/companies" -> null
      - path_part   = "companies" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.company will be destroyed
  - resource "aws_api_gateway_resource" "company" {
      - id          = "sjvaet" -> null
      - parent_id   = "bnvar7" -> null
      - path        = "/companies/{id}" -> null
      - path_part   = "{id}" -> null
      - rest_api_id = "kb7gblbu69" -> null
    }

  # module.policy.aws_iam_policy.lambda_glue_access will be created
  + resource "aws_iam_policy" "lambda_glue_access" {
      + arn         = (known after apply)
      + description = "IAM policy to call glue from a lambda"
      + id          = (known after apply)
      + name        = "iam_policy_lambda_glue_access"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "glue:StartJobRun",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.policy.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "iam_policy_lambda_logging_function_back"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.policy.aws_iam_role.glue_trigger_lambda_exec_role will be created
  + resource "aws_iam_role" "glue_trigger_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue_trigger_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access will be created
  + resource "aws_iam_role_policy_attachment" "glue_trigger_lambda_glue_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue_trigger_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "glue_trigger_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue_trigger_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_all_companies_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_all_companies_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_all_companies_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.policy.aws_lambda_permission.apigw_get_company_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_get_company_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "demo_get_company_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGatewayCompanyId" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - qualifier     = "" -> null
      - source_arn    = (sensitive) -> null
      - statement_id  = "AllowExecutionFromAPIGatewayCompanyId" -> null
    }

Plan: 17 to add, 2 to change, 14 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ridouku, Action: `pull_request`*